Долома/src/Catalogs/Животные/Животные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Животные</name>
  <comment>Данные о животных в стаде(ах)</comment>
  <predefined>
    <items>
      <name>НеопределеннаяМать</name>
      <description>Неопределенная мать</description>
    </items>
  </predefined>
  <attributes>
    <name>Бирка</name>
    <comment>Уникальный номер бирки животного (уникальный номер животного)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БиркаХорриот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родословная</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
</mdclass:Catalog>

Долома/src/InformationRegisters/РодственныеСвязи/РодственныеСвязи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РодственныеСвязи</name>
  <resources>
    <name>Ряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РядРимскими</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предок</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСвязи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Enums/СтатусЖивотного/СтатусЖивотного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЖивотного</name>
  <enumValues>
    <name>Стельная</name>
  </enumValues>
  <enumValues>
    <name>НеСтельная</name>
  </enumValues>
  <enumValues>
    <name>Осеменена</name>
  </enumValues>
</mdclass:Enum>

Долома/src/Catalogs/Животные/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЗАПОЛНИМ ПАРАМЕТРЫ ДИНАМИЧЕСКИХ СПИСКОВ
	ВетеринарныеДокументы.Параметры.Элементы[0].Использование	= Истина;
	ВетеринарныеДокументы.Параметры.Элементы[0].Значение		= Объект.Ссылка;
	ИсторияЖивотного.Параметры.Элементы[0].Использование		= Истина;
	ИсторияЖивотного.Параметры.Элементы[0].Значение				= Объект.Ссылка; 
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СформироватьДеревоСвязей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьИсториюЖивотного();		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсторияЖивотногоДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	
	ТекущиеДанные 			= Элемент.ТекущиеДанные;
	ДокументОткрытия 		= ТекущиеДанные.Ссылка;
	НазваниеДокумента 		= ОбщегоНазначения.ПолучитьИмяМетаданных(ДокументОткрытия);
	
	ОткрытьФорму("Документ." + НазваниеДокумента + ".Форма.ФормаДокумента", Новый Структура("Ключ", ДокументОткрытия));
	
КонецПроцедуры

&НаКлиенте
Процедура ВетДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	
	ТекущиеДанные 					= Элемент.ТекущиеДанные;
	ДокументОткрытия 			= ТекущиеДанные.Регистратор;
	
	ОткрытьЗначениеАсинх(ДокументОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура БиркаПриИзменении(Элемент)
	
	ИзменитьНаименование();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьКличку(Команда)
	ОткрытьФормуДляИзмененияКлички();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьИсториюЖивотного()
	
	СвойстваЖивотного = ДанныеЖивотных.ПолучитьОбщиеДанныеЖивотного(Объект.Ссылка, ТекущаяДатаСеанса());
	
	ДополнительныйПараметр_Осеменений					= СвойстваЖивотного.КоличествоОсеменений;
	ДополнительныйПараметр_Отелов						= СвойстваЖивотного.КоличествоОтелов;
	ДополнительныйПараметр_Корпус						= СвойстваЖивотного.КорпусЖивотного;
	ДополнительныйПараметр_МестоРождения				= СвойстваЖивотного.МестоРождения;
	ДополнительныйПараметр_Ферма						= СвойстваЖивотного.ФермаЖивотного;	
	ДополнительныйПараметр_Вес							= СвойстваЖивотного.Вес;	
	ДополнительныйПараметр_Пол							= СвойстваЖивотного.Пол;
	ДополнительныйПараметр_Статус						= СвойстваЖивотного.СтатусЖивотного;
	ДополнительныйПараметр_ПроизводственнаяГруппа		= СвойстваЖивотного.ПроизводственнаяГруппа;
	ДополнительныйПараметр_ДатаПоследнегоОтела			= СвойстваЖивотного.ДатаПоследнегоОтела;
	ДополнительныйПараметр_ДатаРождения					= СвойстваЖивотного.ДатаРождения;
	ДополнительныйПараметр_Мать 						= СвойстваЖивотного.Мать;
	ДополнительныйПараметр_Отец 						= СвойстваЖивотного.Отец;
	ДополнительныйПараметр_МолокоЗаЛактации				= СвойстваЖивотного.МолокоЗаЛактацию;
	ДополнительныйПараметр_ВетСтатус					= СвойстваЖивотного.ВетСтатус;
	ДополнительныйПараметр_ДатаПредполагаемогоОтела 	= ?(СвойстваЖивотного.ДатаПоследнегоОсеменения > ДополнительныйПараметр_ДатаПоследнегоОтела 
																И СвойстваЖивотного.СтатусЖивотного=Перечисления.СтатусЖивотного.Стельная, 
																	СвойстваЖивотного.ДатаПредполагаемогоОтела, 
																		Дата(1, 1, 1));
																																
	ДополнительныйПараметр_ДойныхДней					= ?(ДополнительныйПараметр_ДатаПоследнегоОтела 	= Дата(1, 1, 1), 
																	0,
																	ОбщегоНазначения.РазностьДат(
																			?(СвойстваЖивотного.Актуальность, 
																					ТекущаяДата(), 
																					СвойстваЖивотного.ДатаВыбытия), 
																			ДополнительныйПараметр_ДатаПоследнегоОтела));
																	
																																			
	ДополнительныйПараметр_ДнейДоЗапуска				= СвойстваЖивотного.ДнейДоЗапуска;	
	ДополнительныйПараметр_ДатаПоследнегоОсеменения 	= СвойстваЖивотного.ДатаПоследнегоОсеменения;
	ДополнительныйПараметр_ПоследнийБыкОсеменения       = СвойстваЖивотного.ПоследнийБыкОсеменения;
	ДополнительныйПараметр_ВесЖивотного 				= СвойстваЖивотного.ПоследнийВесЖивотного;
	ДополнительныйПараметр_МежотёльныйПериод 			= СвойстваЖивотного.МежотёльныйПериод;
	
	Если СвойстваЖивотного.Брак ИЛИ НЕ СвойстваЖивотного.Актуальность Тогда
		Элементы.ЖивотноеВАрхивеНадпись.Заголовок 	= ?(НЕ СвойстваЖивотного.Актуальность, "Животное находится в архиве", "Не осеменять");	
		Элементы.ЖивотноеВАрхивеНадпись.Видимость = Истина;	
	КонецЕсли; 
	
	ДополнительныйПараметр_ДатаВыбытия 					= СвойстваЖивотного.ДатаВыбытия;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаименование()
	
	Объект.Наименование = "" + Объект.Бирка + " " + Объект.Кличка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДляИзмененияКлички()
	
	ПараметрыФормы = Новый Структура;
	
	МассивЖивотных = Новый Массив;
	МассивЖивотных.Добавить(Объект.Ссылка);
	
	ПараметрыФормы.Вставить("МассивЖивотных", МассивЖивотных);
	
	ОткрытьФорму("Документ.ИзменениеКлички.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСРодословной

&НаКлиенте
Процедура РодословнаяПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Родословная) Тогда
		СформироватьДеревоСвязей();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоСвязей()
	
	ДеревоСвязей = РегистрыСведений.РодственныеСвязи.СформироватьДеревоСвязей(Объект.Родословная);
	ЗначениеВДанныеФормы(ДеревоСвязей, ДеревоРодственныхСвязей);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРодственныхСвязейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ДеревоРодственныхСвязей.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Предок) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Предок);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти
